#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t
#+OPTIONS: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t
#+OPTIONS: tex:t timestamp:t title:t toc:nil todo:t |:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.3.1 (Org mode 8.3.4)

#+ATTR_LATEX: :align |r|cccHHH|cccHHH|cccHHH|cccHHHHHHHHH|
| Domain                   | \rb{$[f,h,\hh,\depth,\fifo]$} | \rb{$[f,h,\hh,\depth,\lifo]$} | \rb{$[f,h,\hh,\depth,\ro]$} |   R |   R |   R | \rb{$[f,\hh,\depth,\fifo]$} | \rb{$[f,\hh,\depth,\lifo]$} | \rb{$[f,\hh,\depth,\ro]$} |   R |   R |   R | \rb{$[f,\ffo,\fifo]$} | \rb{$[f,\ffo,\lifo]$} | \rb{$[f,\ffo,\ro]$} |   R |   R |   R | \rb{$[f,\ffo,\depth,\fifo]$} | \rb{$[f,\ffo,\depth,\lifo]$} | \rb{$[f,\ffo,\depth,\ro]$} |   R |   R |   R | \rb{$[f,\gco,\fifo]$} | \rb{$[f,\gco,\lifo]$} | \rb{$[f,\gco,\ro]$} |   R |   R |   R |
|--------------------------+-------------------------------+-------------------------------+-----------------------------+-----+-----+-----+-----------------------------+-----------------------------+---------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----+------------------------------+------------------------------+----------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----|
| IPC benchmark (1104)     |                           476 |                           475 | 471.3 $\pm$ 0.6             | 472 | 471 | 471 |                         477 |                         475 | 471 $\pm$ 1               | 471 | 470 | 472 |                   458 |                   457 | 456.3 $\pm$ 0.6     | 456 | 457 | 456 |                          457 |                          457 | 456 $\pm$ 1                | 455 | 457 | 456 |                   494 |                   495 | 490.3 $\pm$ 1.5     | 492 | 489 | 490 |
|--------------------------+-------------------------------+-------------------------------+-----------------------------+-----+-----+-----+-----------------------------+-----------------------------+---------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----+------------------------------+------------------------------+----------------------------+-----+-----+-----+-----------------------+-----------------------+---------------------+-----+-----+-----|
| airport(50)              |                             7 |                             7 | 7 $\pm$ 0                   |   7 |   7 |   7 |                           7 |                           7 | 7 $\pm$ 0                 |   7 |   7 |   7 |                     9 |                     9 | 9 $\pm$ 0           |   9 |   9 |   9 |                            9 |                            9 | 9 $\pm$ 0                  |   9 |   9 |   9 |                     9 |                     9 | 9 $\pm$ 0           |   9 |   9 |   9 |
| barman-opt11(20)         |                             4 |                             4 | 4 $\pm$ 0                   |   4 |   4 |   4 |                           4 |                           4 | 4 $\pm$ 0                 |   4 |   4 |   4 |                     4 |                     4 | 4 $\pm$ 0           |   4 |   4 |   4 |                            4 |                            4 | 4 $\pm$ 0                  |   4 |   4 |   4 |                     4 |                     4 | 4 $\pm$ 0           |   4 |   4 |   4 |
| blocks(35)               |                            21 |                            21 | 21 $\pm$ 0                  |  21 |  21 |  21 |                          22 |                          21 | 21 $\pm$ 0                |  21 |  21 |  21 |                    21 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |                           20 |                           20 | 20 $\pm$ 0                 |  20 |  20 |  20 |                    22 |                    22 | 22 $\pm$ 0          |  22 |  22 |  22 |
| *cybersec(19)*           |                             0 |                             0 | 0 $\pm$ 0                   |   0 |   0 |   0 |                           0 |                           0 | 0 $\pm$ 0                 |   0 |   0 |   0 |                     0 |                     0 | 0 $\pm$ 0           |   0 |   0 |   0 |                            0 |                            0 | 0 $\pm$ 0                  |   0 |   0 |   0 |                     0 |                     0 | 0 $\pm$ 0           |   0 |   0 |   0 |
| depot(22)                |                             5 |                             5 | 5 $\pm$ 0                   |   5 |   5 |   5 |                           5 |                           5 | 5 $\pm$ 0                 |   5 |   5 |   5 |                     4 |                     4 | 4 $\pm$ 0           |   4 |   4 |   4 |                            4 |                            4 | 4 $\pm$ 0                  |   4 |   4 |   4 |                     5 |                     6 | 5 $\pm$ 0           |   5 |   5 |   5 |
| driverlog(20)            |                            12 |                            12 | 12 $\pm$ 0                  |  12 |  12 |  12 |                          12 |                          12 | 12 $\pm$ 0                |  12 |  12 |  12 |                    11 |                    11 | 11 $\pm$ 0          |  11 |  11 |  11 |                           11 |                           11 | 11 $\pm$ 0                 |  11 |  11 |  11 |                    12 |                    12 | 12 $\pm$ 0          |  12 |  12 |  12 |
| elevators-opt11(20)      |                            13 |                            13 | 12 $\pm$ 0                  |  12 |  12 |  12 |                          13 |                          13 | 12 $\pm$ 0                |  12 |  12 |  12 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |                           10 |                           10 | 10 $\pm$ 0                 |  10 |  10 |  10 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |
| floortile-opt11(20)      |                             6 |                             6 | 6 $\pm$ 0                   |   6 |   6 |   6 |                           6 |                           6 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     7 |                     7 | 7 $\pm$ 0           |   7 |   7 |   7 |                            7 |                            7 | 7 $\pm$ 0                  |   7 |   7 |   7 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |
| freecell(80)             |                            15 |                            15 | 15 $\pm$ 0                  |  15 |  15 |  15 |                          15 |                          15 | 15 $\pm$ 0                |  15 |  15 |  15 |                    14 |                    14 | 14 $\pm$ 0          |  14 |  14 |  14 |                           14 |                           14 | 14 $\pm$ 0                 |  14 |  14 |  14 |                    17 |                    17 | 16 $\pm$ 0          |  16 |  16 |  16 |
| grid(5)                  |                             2 |                             2 | 2 $\pm$ 0                   |   2 |   2 |   2 |                           2 |                           2 | 2 $\pm$ 0                 |   2 |   2 |   2 |                     2 |                     2 | 2 $\pm$ 0           |   2 |   2 |   2 |                            2 |                            2 | 2 $\pm$ 0                  |   2 |   2 |   2 |                     2 |                     2 | 2 $\pm$ 0           |   2 |   2 |   2 |
| gripper(20)              |                            20 |                            20 | 20 $\pm$ 0                  |  20 |  20 |  20 |                          20 |                          20 | 20 $\pm$ 0                |  20 |  20 |  20 |                    20 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |                           20 |                           20 | 20 $\pm$ 0                 |  20 |  20 |  20 |                    20 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |
| hanoi(30)                |                            14 |                            14 | 14 $\pm$ 0                  |  14 |  14 |  14 |                          14 |                          14 | 14 $\pm$ 0                |  14 |  14 |  14 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |                           13 |                           13 | 13 $\pm$ 0                 |  13 |  13 |  13 |                    14 |                    14 | 14 $\pm$ 0          |  14 |  14 |  14 |
| logistics00(28)          |                            20 |                            20 | 20 $\pm$ 0                  |  20 |  20 |  20 |                          20 |                          20 | 20 $\pm$ 0                |  20 |  20 |  20 |                    20 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |                           20 |                           20 | 20 $\pm$ 0                 |  20 |  20 |  20 |                    20 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |
| miconic(150)             |                            72 |                            72 | 72 $\pm$ 0                  |  72 |  72 |  72 |                          72 |                          72 | 72 $\pm$ 0                |  72 |  72 |  72 |                    69 |                    69 | 69 $\pm$ 0          |  69 |  69 |  69 |                           69 |                           69 | 69 $\pm$ 0                 |  69 |  69 |  69 |                    73 |                    73 | 73 $\pm$ 0          |  73 |  73 |  73 |
| mprime(35)               |                            20 |                            19 | 19.7 $\pm$ 0.6              |  20 |  19 |  20 |                          19 |                          19 | 19.7 $\pm$ 0.6            |  20 |  19 |  20 |                    21 |                    21 | 21 $\pm$ 1          |  20 |  22 |  21 |                           21 |                           21 | 21 $\pm$ 1                 |  20 |  22 |  21 |                    23 |                    23 | 22.7 $\pm$ 0.6      |  23 |  22 |  23 |
| mystery(30)              |                            15 |                            15 | 15 $\pm$ 0                  |  15 |  15 |  15 |                          15 |                          15 | 15 $\pm$ 0                |  15 |  15 |  15 |                    15 |                    15 | 15 $\pm$ 0          |  15 |  15 |  15 |                           15 |                           15 | 15 $\pm$ 0                 |  15 |  15 |  15 |                    15 |                    15 | 15 $\pm$ 0          |  15 |  15 |  15 |
| nomystery-opt11(20)      |                            18 |                            18 | 18 $\pm$ 0                  |  18 |  18 |  18 |                          18 |                          18 | 18 $\pm$ 0                |  18 |  18 |  18 |                    16 |                    16 | 16 $\pm$ 0          |  16 |  16 |  16 |                           16 |                           16 | 16 $\pm$ 0                 |  16 |  16 |  16 |                    18 |                    18 | 18 $\pm$ 0          |  18 |  18 |  18 |
| *openstacks-opt11(20)*   |                            18 |                            19 | 18 $\pm$ 0                  |  18 |  18 |  18 |                          18 |                          19 | 18 $\pm$ 0                |  18 |  18 |  18 |                    18 |                    18 | 18 $\pm$ 0          |  18 |  18 |  18 |                           18 |                           18 | 17.7 $\pm$ 0.6             |  17 |  18 |  18 |                    19 |                    19 | 19 $\pm$ 0          |  19 |  19 |  19 |
| parcprinter-opt11(20)    |                            10 |                            10 | 10 $\pm$ 0                  |  10 |  10 |  10 |                          10 |                          10 | 10 $\pm$ 0                |  10 |  10 |  10 |                    11 |                    11 | 11 $\pm$ 0          |  11 |  11 |  11 |                           11 |                           11 | 11 $\pm$ 0                 |  11 |  11 |  11 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |
| parking-opt11(20)        |                             1 |                             1 | 1 $\pm$ 0                   |   1 |   1 |   1 |                           1 |                           1 | 1 $\pm$ 0                 |   1 |   1 |   1 |                     0 |                     0 | 0 $\pm$ 0           |   0 |   0 |   0 |                            0 |                            0 | 0 $\pm$ 0                  |   0 |   0 |   0 |                     1 |                     1 | 1 $\pm$ 0           |   1 |   1 |   1 |
| pathways(30)             |                             4 |                             4 | 4 $\pm$ 0                   |   4 |   4 |   4 |                           4 |                           4 | 4 $\pm$ 0                 |   4 |   4 |   4 |                     4 |                     4 | 4 $\pm$ 0           |   4 |   4 |   4 |                            4 |                            4 | 4 $\pm$ 0                  |   4 |   4 |   4 |                     4 |                     4 | 4 $\pm$ 0           |   4 |   4 |   4 |
| pegsol-opt11(20)         |                            19 |                            19 | 19 $\pm$ 0                  |  19 |  19 |  19 |                          19 |                          19 | 19 $\pm$ 0                |  19 |  19 |  19 |                    17 |                    17 | 17 $\pm$ 0          |  17 |  17 |  17 |                           17 |                           17 | 17 $\pm$ 0                 |  17 |  17 |  17 |                    19 |                    19 | 19 $\pm$ 0          |  19 |  19 |  19 |
| pipesworld-notankage(50) |                             6 |                             5 | 5.7 $\pm$ 0.6               |   5 |   6 |   6 |                           6 |                           5 | 5.3 $\pm$ 0.6             |   5 |   5 |   6 |                     9 |                     9 | 8.7 $\pm$ 0.6       |   9 |   8 |   9 |                            9 |                            9 | 8.7 $\pm$ 0.6              |   9 |   8 |   9 |                    10 |                    10 | 9.3 $\pm$ 0.6       |  10 |   9 |   9 |
| pipesworld-tankage(50)   |                            12 |                            12 | 12 $\pm$ 0                  |  12 |  12 |  12 |                          12 |                          12 | 12 $\pm$ 0                |  12 |  12 |  12 |                     9 |                     9 | 9 $\pm$ 0           |   9 |   9 |   9 |                            9 |                            9 | 9 $\pm$ 0                  |   9 |   9 |   9 |                    13 |                    13 | 13 $\pm$ 0          |  13 |  13 |  13 |
| psr-small(50)            |                            50 |                            50 | 50 $\pm$ 0                  |  50 |  50 |  50 |                          50 |                          50 | 50 $\pm$ 0                |  50 |  50 |  50 |                    50 |                    50 | 50 $\pm$ 0          |  50 |  50 |  50 |                           50 |                           50 | 50 $\pm$ 0                 |  50 |  50 |  50 |                    50 |                    50 | 50 $\pm$ 0          |  50 |  50 |  50 |
| rovers(40)               |                             7 |                             8 | 6.3 $\pm$ 0.6               |   7 |   6 |   6 |                           8 |                           8 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     8 |                     8 | 7.7 $\pm$ 0.6       |   7 |   8 |   8 |
| scanalyzer-opt11(20)     |                            10 |                            10 | 9.3 $\pm$ 0.6               |   9 |  10 |   9 |                          10 |                          10 | 9.7 $\pm$ 0.6             |   9 |  10 |  10 |                     7 |                     7 | 6.3 $\pm$ 0.6       |   6 |   7 |   6 |                            7 |                            7 | 6.3 $\pm$ 0.6              |   6 |   7 |   6 |                    11 |                    11 | 11 $\pm$ 0          |  11 |  11 |  11 |
| sokoban-opt11(20)        |                            18 |                            18 | 18 $\pm$ 0                  |  18 |  18 |  18 |                          18 |                          18 | 18 $\pm$ 0                |  18 |  18 |  18 |                    19 |                    19 | 19 $\pm$ 0          |  19 |  19 |  19 |                           19 |                           19 | 19 $\pm$ 0                 |  19 |  19 |  19 |                    20 |                    20 | 20 $\pm$ 0          |  20 |  20 |  20 |
| storage(30)              |                            15 |                            15 | 15 $\pm$ 0                  |  15 |  15 |  15 |                          15 |                          15 | 15 $\pm$ 0                |  15 |  15 |  15 |                    14 |                    14 | 14 $\pm$ 0          |  14 |  14 |  14 |                           14 |                           14 | 14 $\pm$ 0                 |  14 |  14 |  14 |                    15 |                    15 | 15 $\pm$ 0          |  15 |  15 |  15 |
| tidybot-opt11(20)        |                             0 |                             0 | 0 $\pm$ 0                   |   0 |   0 |   0 |                           0 |                           0 | 0 $\pm$ 0                 |   0 |   0 |   0 |                     0 |                     0 | 0 $\pm$ 0           |   0 |   0 |   0 |                            0 |                            0 | 0 $\pm$ 0                  |   0 |   0 |   0 |                     0 |                     0 | 0 $\pm$ 0           |   0 |   0 |   0 |
| tpp(30)                  |                             6 |                             6 | 6 $\pm$ 0                   |   6 |   6 |   6 |                           6 |                           6 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |
| transport-opt11(20)      |                             7 |                             7 | 6 $\pm$ 0                   |   6 |   6 |   6 |                           7 |                           7 | 6 $\pm$ 0                 |   6 |   6 |   6 |                     6 |                     6 | 6 $\pm$ 0           |   6 |   6 |   6 |                            6 |                            6 | 6 $\pm$ 0                  |   6 |   6 |   6 |                     7 |                     7 | 6 $\pm$ 0           |   6 |   6 |   6 |
| visitall-opt11(20)       |                             9 |                             9 | 9 $\pm$ 0                   |   9 |   9 |   9 |                           9 |                           9 | 9 $\pm$ 0                 |   9 |   9 |   9 |                     9 |                     9 | 9 $\pm$ 0           |   9 |   9 |   9 |                            9 |                            9 | 9 $\pm$ 0                  |   9 |   9 |   9 |                     9 |                     9 | 9 $\pm$ 0           |   9 |   9 |   9 |
| woodworking-opt11(20)    |                             8 |                             8 | 8.3 $\pm$ 0.6               |   9 |   8 |   8 |                           8 |                           8 | 8.3 $\pm$ 0.6             |   9 |   8 |   8 |                     7 |                     7 | 7.3 $\pm$ 0.6       |   8 |   7 |   7 |                            7 |                            7 | 7.3 $\pm$ 0.6              |   8 |   7 |   7 |                     7 |                     7 | 7.3 $\pm$ 0.6       |   8 |   7 |   7 |
| zenotravel(20)           |                            12 |                            11 | 11 $\pm$ 0                  |  11 |  11 |  11 |                          12 |                          11 | 11 $\pm$ 0                |  11 |  11 |  11 |                    10 |                    10 | 10 $\pm$ 0          |  10 |  10 |  10 |                           10 |                           10 | 10 $\pm$ 0                 |  10 |  10 |  10 |                    12 |                    12 | 11.3 $\pm$ 0.6      |  12 |  11 |  11 |
#+TBLFM: $4=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$10=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$16=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$22=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1::$28=choriz([vmean($+1..$+3),vsdev($+1..$+3)]," $\\pm$ "); E f-1
